Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionWrongType Property
 Structural Connection has an inappropriate type assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionWrongType { get; }
Public Shared ReadOnly Property StructuralConnectionWrongType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionWrongType {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionWrongType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace